// Напишите программу, которая принимает на вход число и выдает его квадрат/
System.Console.WriteLine("Введите число: "); //cw -бытрый ввызов этой команды
int userNamber = Convert.ToInt32(Console.ReadLine());
int result = userNamber * userNamber;
System.Console.WriteLine(result);

// System.Console.WriteLine("Введите число: "); //cw быстрый вызов Console.WriteLine
// int userNamber = Convert.ToInt32(Console.ReadLine());
// int result = userNamber * userNamber;
// Console.WriteLine(result);